backend/tests/load/artillery-config.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
  processor: "./artillery-processor.js"

scenarios:
  - name: "Read-Heavy Workload - Get All Requests"
    weight: 80
    flow:
      - get:
          url: "/api/requests"
          headers:
            Authorization: "Bearer {{authToken}}"
          capture:
            - json: "$.data.length"
              as: "requestCount"
      - think: 1

  - name: "Write Workload - Create Request"
    weight: 20
    flow:
      - post:
          url: "/api/requests"
          headers:
            Authorization: "Bearer {{authToken}}"
            Content-Type: "application/json"
          json:
            title: "Load Test Request {{$randomString()}}"
            description: "This is a load test request"
            categoryId: 1
            quantity: 10
            unit: "pieces"
      - think: 2